import subprocess

prompts = [
    "一只聪明的狐狸走在阔叶树林里, 旁边是一条小溪, 细节真实, 摄影",
    "湖水清澈，天空湛蓝，阳光灿烂。一只优雅的白天鹅在湖边游泳。它周围有几只小鸭子，看起来非常可爱，整个画面给人一种宁静祥和的感觉。",
    "太阳微微升起，花园里的玫瑰花瓣上露珠晶莹剔透，一只瓢虫正在爬向露珠，背景是清晨的花园，微距镜头",
    "一位女明星，中国人，头发是黑色，衣服是纯白色短袖，人物风格清新，城市背景",
    "后印象主义风格，一条古老的石板路上面散落着金黄色的树叶。路旁的风车在静谧地转动，后面竖着两个风车。背景是一片向日葵田，蓝天上飘着几朵白云",
    "一幅细致的油画描绘了一只年轻獾轻轻嗅着一朵明亮的黄色玫瑰时错综复杂的皮毛。背景是一棵大树干的粗糙纹理，獾的爪子轻轻地挖进树皮。在柔和的背景中，一个宁静的瀑布倾泻而下，它的水在绿色植物中闪烁着蓝色。",
    "渔舟唱晚",
    "请将杞人忧天的样子画出来",
    "一只长靴猫手持亮银色的宝剑，身着铠甲，眼神坚毅，站在一堆金币上，背景是暗色调的洞穴，图像上有金币的光影点缀。",
    "插画风格，一只狐狸和一只刺猬坐在水边的石头上，刺猬手里拿着一杯茶，狐狸旁边放着一个玻璃杯。周围是茂密的绿色植物和树木，阳光透过树叶洒在水面上，画面宁静温馨。"
]

for i, prompt in enumerate(prompts):
    command = [
        "python", "sample_t2i.py",
        "--infer-mode", "fa",
        "--prompt", prompt,
        "--no-enhance",
        "--infer-steps", "10"
    ]
    print(f"Running command for prompt {i + 1}: {prompt}")
    subprocess.run(command)